# set arguments for all 'brew install --cask' commands
# Note: require_sha disabled to prevent installation failures
# cask_args appdir: "~/Applications"

# Regular packages
brew "awscli"
brew "ctop"
brew "diff-so-fancy"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "git-friendly/git-friendly/git-friendly"
brew "git"
brew "go"
brew "htop"
brew "jpegoptim"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "minikube"
brew "node"
brew "node@22"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "php"
brew "php@8.3"
brew "stow"
brew "symfony-cli/tap/symfony-cli"
brew "tree"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "yq"
brew "zsh-syntax-highlighting"
brew "zsh"

# Cask packages
cask "1password"
cask "arc"
cask "betterzip"
cask "claude-code"
cask "claude"
cask "discord"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "insomnia"
cask "intellij-idea-ce"
cask "istat-menus"
cask "logi-options+"
cask "obsidian"
cask "orbstack"
cask "phpstorm"
cask "proxyman"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "slack"
cask "syntax-highlight"
cask "tableplus"
cask "visual-studio-code"
cask "zed"
cask "zoom"
